###################################################################

# Created by write_sdc on Wed Jul  4 09:45:34 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports wb_clk_i]  -name CLK  -period 4  -waveform {0 2}
set_input_delay -clock CLK  -max 1  [get_ports wb_clk_i]
set_input_delay -clock CLK  -min 0  [get_ports wb_clk_i]
set_input_delay -clock CLK  -max 1  [get_ports wb_rst_i]
set_input_delay -clock CLK  -min 0  [get_ports wb_rst_i]
set_input_delay -clock CLK  -max 1  [get_ports {wb_adr_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_adr_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_adr_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_adr_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_adr_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_adr_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_dat_i[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_dat_i[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_dat_i[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_dat_i[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_dat_i[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_dat_i[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_dat_i[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_dat_i[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_dat_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_dat_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_dat_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_dat_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_dat_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_dat_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_dat_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_dat_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports wb_we_i]
set_input_delay -clock CLK  -min 0  [get_ports wb_we_i]
set_input_delay -clock CLK  -max 1  [get_ports wb_stb_i]
set_input_delay -clock CLK  -min 0  [get_ports wb_stb_i]
set_input_delay -clock CLK  -max 1  [get_ports wb_cyc_i]
set_input_delay -clock CLK  -min 0  [get_ports wb_cyc_i]
set_input_delay -clock CLK  -max 1  [get_ports {wb_sel_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_sel_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_sel_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_sel_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_sel_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_sel_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wb_sel_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wb_sel_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports srx_pad_i]
set_input_delay -clock CLK  -min 0  [get_ports srx_pad_i]
set_input_delay -clock CLK  -max 1  [get_ports cts_pad_i]
set_input_delay -clock CLK  -min 0  [get_ports cts_pad_i]
set_input_delay -clock CLK  -max 1  [get_ports dsr_pad_i]
set_input_delay -clock CLK  -min 0  [get_ports dsr_pad_i]
set_input_delay -clock CLK  -max 1  [get_ports ri_pad_i]
set_input_delay -clock CLK  -min 0  [get_ports ri_pad_i]
set_input_delay -clock CLK  -max 1  [get_ports dcd_pad_i]
set_input_delay -clock CLK  -min 0  [get_ports dcd_pad_i]
set_output_delay -clock CLK  -max 1  [get_ports {wb_dat_o[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {wb_dat_o[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {wb_dat_o[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {wb_dat_o[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {wb_dat_o[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {wb_dat_o[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {wb_dat_o[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {wb_dat_o[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {wb_dat_o[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {wb_dat_o[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {wb_dat_o[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {wb_dat_o[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {wb_dat_o[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {wb_dat_o[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {wb_dat_o[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {wb_dat_o[0]}]
set_output_delay -clock CLK  -max 1  [get_ports wb_ack_o]
set_output_delay -clock CLK  -min 3  [get_ports wb_ack_o]
set_output_delay -clock CLK  -max 1  [get_ports int_o]
set_output_delay -clock CLK  -min 3  [get_ports int_o]
set_output_delay -clock CLK  -max 1  [get_ports stx_pad_o]
set_output_delay -clock CLK  -min 3  [get_ports stx_pad_o]
set_output_delay -clock CLK  -max 1  [get_ports rts_pad_o]
set_output_delay -clock CLK  -min 3  [get_ports rts_pad_o]
set_output_delay -clock CLK  -max 1  [get_ports dtr_pad_o]
set_output_delay -clock CLK  -min 3  [get_ports dtr_pad_o]
