###################################################################

# Created by write_sdc on Thu Jul 12 05:52:06 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports wb_clk_i]  -name CLK  -period 4  -waveform {0 2}
set_input_delay -clock CLK  -max 1  [get_ports wb_clk_i]
set_input_delay -clock CLK  -min 0  [get_ports wb_clk_i]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[31]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[30]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[29]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[28]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[27]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[26]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[25]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[24]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[23]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[22]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[21]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[20]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[19]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[18]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[17]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[16]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_adr_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_adr_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_bte_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_bte_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_bte_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_bte_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_cti_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_cti_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_cti_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_cti_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_cti_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_cti_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports wbm0_cyc_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm0_cyc_i]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[31]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[30]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[29]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[28]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[27]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[26]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[25]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[24]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[23]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[22]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[21]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[20]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[19]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[18]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[17]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[16]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_dat_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_dat_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_sel_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_sel_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_sel_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_sel_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_sel_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_sel_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm0_sel_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm0_sel_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports wbm0_stb_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm0_stb_i]
set_input_delay -clock CLK  -max 1  [get_ports wbm0_we_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm0_we_i]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[31]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[30]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[29]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[28]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[27]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[26]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[25]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[24]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[23]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[22]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[21]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[20]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[19]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[18]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[17]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[16]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_adr_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_adr_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_bte_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_bte_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_bte_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_bte_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_cti_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_cti_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_cti_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_cti_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_cti_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_cti_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports wbm1_cyc_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm1_cyc_i]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[31]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[30]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[29]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[28]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[27]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[26]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[25]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[24]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[23]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[22]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[21]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[20]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[19]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[18]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[17]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[16]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_dat_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_dat_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_sel_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_sel_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_sel_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_sel_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_sel_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_sel_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm1_sel_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm1_sel_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports wbm1_stb_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm1_stb_i]
set_input_delay -clock CLK  -max 1  [get_ports wbm1_we_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm1_we_i]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[31]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[30]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[29]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[28]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[27]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[26]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[25]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[24]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[23]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[22]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[21]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[20]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[19]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[18]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[17]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[16]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_adr_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_adr_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_bte_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_bte_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_bte_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_bte_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_cti_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_cti_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_cti_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_cti_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_cti_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_cti_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports wbm2_cyc_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm2_cyc_i]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[31]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[31]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[30]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[30]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[29]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[29]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[28]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[28]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[27]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[27]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[26]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[26]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[25]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[25]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[24]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[24]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[23]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[23]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[22]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[22]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[21]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[21]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[20]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[20]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[19]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[19]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[18]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[18]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[17]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[17]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[16]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[16]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[15]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[14]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[13]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[12]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[11]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[10]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[9]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[8]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[7]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[6]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[5]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[4]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_dat_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_dat_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_sel_i[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_sel_i[3]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_sel_i[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_sel_i[2]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_sel_i[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_sel_i[1]}]
set_input_delay -clock CLK  -max 1  [get_ports {wbm2_sel_i[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {wbm2_sel_i[0]}]
set_input_delay -clock CLK  -max 1  [get_ports wbm2_stb_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm2_stb_i]
set_input_delay -clock CLK  -max 1  [get_ports wbm2_we_i]
set_input_delay -clock CLK  -min 0  [get_ports wbm2_we_i]
set_input_delay -clock CLK  -max 1  [get_ports wb_rst_i]
set_input_delay -clock CLK  -min 0  [get_ports wb_rst_i]
set_output_delay -clock CLK  -max 1  [get_ports wbm0_ack_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm0_ack_o]
set_output_delay -clock CLK  -max 1  [get_ports wbm0_err_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm0_err_o]
set_output_delay -clock CLK  -max 1  [get_ports wbm0_rty_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm0_rty_o]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm0_dat_o[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm0_dat_o[0]}]
set_output_delay -clock CLK  -max 1  [get_ports wbm1_ack_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm1_ack_o]
set_output_delay -clock CLK  -max 1  [get_ports wbm1_err_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm1_err_o]
set_output_delay -clock CLK  -max 1  [get_ports wbm1_rty_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm1_rty_o]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm1_dat_o[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm1_dat_o[0]}]
set_output_delay -clock CLK  -max 1  [get_ports wbm2_ack_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm2_ack_o]
set_output_delay -clock CLK  -max 1  [get_ports wbm2_err_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm2_err_o]
set_output_delay -clock CLK  -max 1  [get_ports wbm2_rty_o]
set_output_delay -clock CLK  -min 3  [get_ports wbm2_rty_o]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {wbm2_dat_o[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {wbm2_dat_o[0]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[127]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[127]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[126]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[126]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[125]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[125]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[124]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[124]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[123]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[123]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[122]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[122]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[121]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[121]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[120]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[120]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[119]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[119]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[118]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[118]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[117]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[117]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[116]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[116]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[115]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[115]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[114]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[114]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[113]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[113]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[112]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[112]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[111]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[111]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[110]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[110]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[109]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[109]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[108]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[108]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[107]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[107]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[106]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[106]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[105]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[105]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[104]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[104]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[103]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[103]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[102]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[102]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[101]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[101]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[100]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[100]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[99]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[99]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[98]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[98]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[97]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[97]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[96]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[96]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[95]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[95]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[94]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[94]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[93]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[93]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[92]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[92]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[91]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[91]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[90]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[90]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[89]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[89]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[88]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[88]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[87]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[87]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[86]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[86]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[85]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[85]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[84]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[84]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[83]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[83]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[82]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[82]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[81]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[81]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[80]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[80]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[79]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[79]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[78]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[78]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[77]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[77]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[76]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[76]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[75]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[75]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[74]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[74]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[73]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[73]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[72]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[72]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[71]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[71]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[70]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[70]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[69]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[69]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[68]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[68]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[67]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[67]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[66]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[66]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[65]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[65]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[64]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[64]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[63]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[63]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[62]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[62]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[61]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[61]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[60]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[60]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[59]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[59]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[58]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[58]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[57]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[57]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[56]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[56]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[55]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[55]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[54]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[54]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[53]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[53]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[52]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[52]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[51]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[51]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[50]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[50]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[49]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[49]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[48]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[48]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[47]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[47]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[46]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[46]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[45]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[45]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[44]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[44]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[43]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[43]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[42]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[42]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[41]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[41]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[40]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[40]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[39]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[39]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[38]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[38]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[37]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[37]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[36]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[36]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[35]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[35]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[34]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[34]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[33]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[33]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[32]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[32]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_sfll_key[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_sfll_key[0]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[127]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[127]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[126]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[126]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[125]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[125]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[124]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[124]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[123]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[123]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[122]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[122]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[121]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[121]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[120]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[120]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[119]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[119]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[118]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[118]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[117]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[117]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[116]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[116]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[115]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[115]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[114]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[114]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[113]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[113]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[112]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[112]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[111]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[111]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[110]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[110]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[109]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[109]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[108]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[108]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[107]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[107]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[106]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[106]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[105]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[105]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[104]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[104]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[103]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[103]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[102]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[102]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[101]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[101]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[100]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[100]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[99]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[99]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[98]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[98]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[97]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[97]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[96]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[96]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[95]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[95]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[94]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[94]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[93]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[93]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[92]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[92]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[91]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[91]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[90]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[90]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[89]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[89]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[88]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[88]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[87]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[87]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[86]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[86]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[85]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[85]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[84]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[84]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[83]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[83]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[82]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[82]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[81]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[81]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[80]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[80]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[79]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[79]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[78]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[78]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[77]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[77]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[76]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[76]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[75]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[75]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[74]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[74]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[73]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[73]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[72]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[72]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[71]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[71]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[70]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[70]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[69]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[69]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[68]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[68]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[67]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[67]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[66]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[66]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[65]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[65]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[64]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[64]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[63]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[63]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[62]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[62]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[61]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[61]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[60]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[60]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[59]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[59]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[58]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[58]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[57]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[57]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[56]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[56]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[55]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[55]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[54]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[54]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[53]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[53]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[52]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[52]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[51]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[51]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[50]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[50]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[49]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[49]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[48]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[48]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[47]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[47]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[46]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[46]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[45]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[45]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[44]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[44]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[43]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[43]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[42]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[42]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[41]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[41]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[40]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[40]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[39]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[39]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[38]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[38]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[37]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[37]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[36]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[36]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[35]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[35]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[34]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[34]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[33]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[33]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[32]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[32]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {gps_fll_key[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {gps_fll_key[0]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[127]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[127]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[126]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[126]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[125]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[125]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[124]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[124]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[123]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[123]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[122]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[122]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[121]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[121]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[120]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[120]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[119]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[119]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[118]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[118]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[117]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[117]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[116]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[116]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[115]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[115]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[114]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[114]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[113]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[113]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[112]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[112]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[111]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[111]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[110]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[110]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[109]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[109]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[108]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[108]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[107]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[107]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[106]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[106]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[105]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[105]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[104]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[104]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[103]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[103]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[102]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[102]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[101]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[101]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[100]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[100]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[99]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[99]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[98]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[98]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[97]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[97]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[96]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[96]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[95]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[95]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[94]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[94]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[93]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[93]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[92]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[92]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[91]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[91]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[90]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[90]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[89]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[89]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[88]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[88]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[87]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[87]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[86]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[86]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[85]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[85]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[84]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[84]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[83]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[83]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[82]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[82]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[81]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[81]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[80]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[80]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[79]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[79]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[78]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[78]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[77]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[77]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[76]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[76]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[75]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[75]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[74]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[74]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[73]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[73]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[72]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[72]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[71]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[71]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[70]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[70]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[69]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[69]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[68]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[68]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[67]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[67]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[66]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[66]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[65]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[65]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[64]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[64]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[63]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[63]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[62]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[62]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[61]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[61]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[60]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[60]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[59]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[59]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[58]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[58]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[57]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[57]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[56]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[56]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[55]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[55]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[54]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[54]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[53]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[53]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[52]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[52]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[51]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[51]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[50]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[50]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[49]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[49]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[48]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[48]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[47]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[47]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[46]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[46]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[45]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[45]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[44]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[44]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[43]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[43]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[42]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[42]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[41]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[41]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[40]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[40]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[39]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[39]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[38]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[38]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[37]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[37]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[36]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[36]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[35]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[35]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[34]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[34]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[33]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[33]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[32]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[32]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {fir_coef_key[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {fir_coef_key[0]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[127]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[127]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[126]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[126]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[125]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[125]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[124]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[124]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[123]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[123]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[122]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[122]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[121]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[121]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[120]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[120]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[119]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[119]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[118]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[118]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[117]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[117]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[116]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[116]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[115]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[115]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[114]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[114]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[113]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[113]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[112]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[112]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[111]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[111]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[110]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[110]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[109]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[109]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[108]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[108]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[107]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[107]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[106]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[106]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[105]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[105]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[104]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[104]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[103]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[103]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[102]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[102]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[101]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[101]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[100]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[100]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[99]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[99]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[98]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[98]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[97]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[97]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[96]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[96]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[95]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[95]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[94]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[94]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[93]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[93]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[92]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[92]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[91]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[91]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[90]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[90]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[89]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[89]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[88]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[88]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[87]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[87]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[86]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[86]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[85]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[85]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[84]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[84]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[83]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[83]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[82]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[82]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[81]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[81]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[80]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[80]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[79]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[79]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[78]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[78]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[77]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[77]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[76]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[76]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[75]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[75]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[74]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[74]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[73]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[73]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[72]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[72]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[71]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[71]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[70]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[70]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[69]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[69]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[68]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[68]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[67]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[67]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[66]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[66]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[65]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[65]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[64]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[64]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[63]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[63]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[62]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[62]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[61]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[61]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[60]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[60]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[59]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[59]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[58]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[58]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[57]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[57]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[56]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[56]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[55]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[55]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[54]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[54]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[53]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[53]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[52]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[52]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[51]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[51]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[50]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[50]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[49]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[49]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[48]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[48]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[47]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[47]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[46]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[46]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[45]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[45]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[44]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[44]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[43]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[43]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[42]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[42]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[41]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[41]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[40]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[40]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[39]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[39]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[38]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[38]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[37]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[37]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[36]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[36]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[35]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[35]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[34]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[34]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[33]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[33]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[32]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[32]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {iir_coef_key[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {iir_coef_key[0]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[127]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[127]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[126]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[126]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[125]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[125]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[124]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[124]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[123]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[123]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[122]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[122]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[121]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[121]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[120]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[120]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[119]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[119]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[118]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[118]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[117]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[117]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[116]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[116]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[115]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[115]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[114]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[114]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[113]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[113]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[112]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[112]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[111]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[111]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[110]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[110]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[109]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[109]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[108]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[108]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[107]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[107]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[106]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[106]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[105]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[105]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[104]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[104]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[103]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[103]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[102]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[102]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[101]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[101]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[100]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[100]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[99]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[99]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[98]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[98]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[97]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[97]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[96]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[96]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[95]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[95]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[94]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[94]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[93]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[93]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[92]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[92]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[91]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[91]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[90]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[90]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[89]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[89]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[88]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[88]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[87]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[87]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[86]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[86]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[85]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[85]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[84]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[84]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[83]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[83]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[82]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[82]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[81]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[81]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[80]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[80]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[79]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[79]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[78]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[78]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[77]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[77]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[76]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[76]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[75]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[75]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[74]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[74]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[73]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[73]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[72]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[72]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[71]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[71]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[70]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[70]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[69]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[69]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[68]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[68]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[67]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[67]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[66]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[66]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[65]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[65]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[64]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[64]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[63]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[63]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[62]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[62]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[61]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[61]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[60]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[60]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[59]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[59]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[58]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[58]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[57]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[57]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[56]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[56]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[55]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[55]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[54]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[54]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[53]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[53]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[52]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[52]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[51]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[51]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[50]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[50]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[49]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[49]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[48]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[48]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[47]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[47]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[46]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[46]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[45]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[45]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[44]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[44]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[43]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[43]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[42]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[42]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[41]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[41]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[40]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[40]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[39]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[39]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[38]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[38]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[37]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[37]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[36]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[36]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[35]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[35]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[34]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[34]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[33]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[33]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[32]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[32]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_sfll_key[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_sfll_key[0]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[127]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[127]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[126]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[126]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[125]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[125]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[124]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[124]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[123]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[123]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[122]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[122]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[121]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[121]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[120]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[120]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[119]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[119]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[118]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[118]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[117]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[117]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[116]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[116]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[115]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[115]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[114]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[114]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[113]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[113]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[112]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[112]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[111]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[111]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[110]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[110]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[109]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[109]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[108]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[108]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[107]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[107]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[106]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[106]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[105]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[105]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[104]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[104]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[103]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[103]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[102]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[102]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[101]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[101]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[100]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[100]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[99]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[99]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[98]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[98]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[97]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[97]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[96]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[96]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[95]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[95]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[94]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[94]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[93]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[93]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[92]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[92]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[91]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[91]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[90]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[90]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[89]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[89]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[88]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[88]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[87]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[87]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[86]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[86]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[85]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[85]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[84]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[84]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[83]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[83]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[82]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[82]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[81]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[81]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[80]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[80]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[79]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[79]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[78]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[78]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[77]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[77]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[76]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[76]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[75]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[75]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[74]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[74]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[73]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[73]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[72]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[72]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[71]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[71]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[70]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[70]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[69]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[69]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[68]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[68]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[67]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[67]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[66]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[66]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[65]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[65]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[64]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[64]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[63]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[63]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[62]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[62]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[61]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[61]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[60]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[60]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[59]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[59]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[58]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[58]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[57]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[57]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[56]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[56]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[55]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[55]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[54]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[54]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[53]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[53]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[52]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[52]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[51]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[51]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[50]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[50]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[49]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[49]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[48]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[48]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[47]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[47]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[46]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[46]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[45]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[45]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[44]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[44]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[43]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[43]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[42]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[42]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[41]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[41]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[40]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[40]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[39]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[39]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[38]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[38]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[37]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[37]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[36]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[36]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[35]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[35]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[34]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[34]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[33]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[33]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[32]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[32]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[31]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[31]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[30]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[30]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[29]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[29]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[28]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[28]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[27]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[27]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[26]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[26]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[25]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[25]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[24]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[24]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[23]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[23]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[22]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[22]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[21]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[21]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[20]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[20]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[19]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[19]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[18]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[18]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[17]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[17]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[16]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[16]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[15]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[15]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[14]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[14]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[13]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[13]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[12]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[12]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[11]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[11]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[10]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[10]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[9]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[9]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[8]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[8]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[7]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[7]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[6]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[6]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[5]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[5]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[4]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[4]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[3]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[3]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[2]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[2]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[1]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[1]}]
set_output_delay -clock CLK  -max 1  [get_ports {orp_fll_key[0]}]
set_output_delay -clock CLK  -min 3  [get_ports {orp_fll_key[0]}]
